public class Main {
    public static void main(String[] args) {

        System.out.println("Hello Models.Gambler!");

//TODO
//        Сделать Класс, от которого будут наследоваться игроки
//        (в классе инициализация массивРуки из 6 значений - соответствие 6 костям)
//        Инициализация игроков 1 и 2
//        Создать шаблонов для методов:
//        - бросок
//        - анализ
//        - вывод выброшенной руки (отсортированной или нет?)
//        - выбор для переброса
//        - переброс
//        - сравнение комбинаций
    }

    public static int[] generateHand(){
        // TODO: реализовать генерацию руки (стартовый бросок)
        return null;
    }

    public static
}

